pages/blog/04-Aug-2023.htm
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-08-04 Fri 15:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>04 Aug 2023 - Let's Talk About Frames!</title>
<meta name="description" content="In the 1990's things were crazy and you never knew what browser would be best for a site...unless they told you ;)" />
<meta name="generator" content="Org Mode" />
<link href="../../styles/main.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">04 Aug 2023 - Let&rsquo;s Talk About Frames!</h1>
<p>
First thing&rsquo;s first! I was accused of copying another person&rsquo;s new format just because I had three sections! That&rsquo;s right! <a href="http://onigirionegai.info/~yayoi">Yaya&rsquo;s World&rsquo;s (not old browser ready)</a> news articles usually have three sections and my first blog article also had three sections, so what? That doesn&rsquo;t make them the same and I didn&rsquo;t copy her. It was just an interesting coincidence. Now on to the news of the week for this site. I&rsquo;ve added a new sub-section to my <a href="../test.htm">test page</a> that talks about frames. There aren&rsquo;t any examples on that section, just a few code blocks and talking about frames and why they were used, but it is a new sub-section. I had thought about another new sub-section, the image map section, but I don&rsquo;t remember much about how that worked. I put up a little introduction, but no examples yet, I&rsquo;ll do some research and see what I can dig up and hope to add some examples and descriptions later. I&rsquo;m also going to start writing a little PHP script that will serve as a guest book for this site. It will display guest book entries and have a form at the bottom for you do add new entries. I&rsquo;ll talk a bit more about how this is accomplished a little later after I introduce the guest book itself. The script will hopefully be ready by the time this article goes up.
</p>

<p>
There is one more thing. Blog posts are usually written before they are released. Like, Yaya, I try to do a few updates all at once, but unlike her, I&rsquo;ll usually start with a blog post. That means that the date stamp on the blog post might be different from the one that is shown on the bottom of the page and neither will reflect when the post comes out. The one in the title is when the post is written and the one at the bottom of the page is when it was last updated. I hope that doesn&rsquo;t confuse anyone. Also, every page that is created by Emacs will have a &rsquo;created&rsquo; date. This is actually more of a &rsquo;last modified&rsquo; date because it is updated every time a page is re-published, which happens after every update. Just thought I&rsquo;d let you know.
</p>

<p>
Also! look no sections this time, I can be different! This is not written in my usual tone as I&rsquo;m a little crazy right now because of <a href="https://www.youtube.com/channel/UCt9H_RpQzhxzlyBxFqrdHqA">Fuwamoco</a> Mornings! Those doggos are too cute, and make me a little too hyper, but this is Jon, not Yaya! I wonder if I should sign everything &ldquo;I am not Yaya, I am Jon&rdquo; in honor of the adorable doggos Fuwawa and Mococo!
</p>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2023-08-04 Fri 15:10</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="https://orgmode.org">Org</a> mode 9.6)</p>
</div>
</body>
</html>
